# ImagePlacementOptions Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ImagePlacementOptions Constructor
ImagePlacementOptions Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ImagePlacementOptions()()()() | Constructs a new ImagePlacementOptions that will place an ImageInstance with its center at the origin of the model |
| ImagePlacementOptions(XYZ, BoxPlacement) | Constructs a new ImagePlacementOptions for placing an ImageInstance |

# See Also
ImagePlacementOptions Class
ImagePlacementOptions Members
Autodesk.Revit.DB Namespace